app/controllers/favorites_controller.rb

  def create
    post_image = PostImage.find(params[:post_image_id])                       # どの画像の情報が渡されたかfind(params[:post_image_id])により調べる ← Viewからデータをもらい、DBに探しに行く
    favorite = current_user.favorites.new(post_image_id: post_image.id)       # いいねされた画像をユーザのIDと画像のデータを紐付けてDBのカラムに保存できる様にする
    favorite.save                                                             # DBに保存する
---
SELECT  "post_images".* FROM "post_images" WHERE "post_images"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "post_image_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["post_image_id", 1], ["created_at", "2020-03-10 11:27:48.175607"], ["updated_at", "2020-03-10 11:27:48.175607"]]

  def destroy
    post_image = PostImage.find(params[:post_image_id])
    favorite = current_user.favorites.find_by(post_image_id: post_image.id)
    favorite.destroy
---
SELECT  "post_images".* FROM "post_images" WHERE "post_images"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."post_image_id" = ? LIMIT ?  [["user_id", 1], ["post_image_id", 1], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]