app/controllers/post_images_controller.rb

  def create
    @post_image = PostImage.new(post_image_params)
    @post_image.user_id = current_user.id
    if @post_image.save                                               # saveできたら下記を実行する
---
INSERT INTO "post_images" ("shop_name", "image_id", "caption", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def index
    @post_images = PostImage.page(params[:page]).reverse_order        # indexページでdbから取得するデータ数を全部 → 1ページに決められた数のデータだけを、新しい順に取得するメソッド
---
SELECT  "post_images".* FROM "post_images" ORDER BY "post_images"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]

  def destroy
    @post_image = PostImage.find(params[:id])                         # Viewから送られてきたIDを元にDB内の画像を探し見つける
    @post_image.destroy                                               # DB内で該当するIDの画像を削除する
---
SELECT  "post_images".* FROM "post_images" WHERE "post_images"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "post_images" WHERE "post_images"."id" = ?  [["id", 2]]