app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "post_images".* FROM "post_images" WHERE "post_images"."user_id" = ? ORDER BY "post_images"."id" DESC LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
---
  def show
    @user = User.find(params[:id])
    @post_images = @user.post_images.page(params[:page]).reverse_order

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "802fc2252326ed77d4e061823234bdf358302e0fe26c14848e2ef02659de"], ["updated_at", "2020-03-11 07:20:25.954953"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    @user.update(user_params)